RIET/src/DataProcessors/EmailNotificationOfActiveUsers/EmailNotificationOfActiveUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>EmailNotificationOfActiveUsers</name>
</mdclass:DataProcessor>

RIET/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>ПотребоватьСменуПароляПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияНеОграничен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПросрочкаРаботыВПрограммеДоЗапрещенияВхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаАвтоматическогоЗапрещенияВхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаИспользованияПароля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованныеПароли</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПоследнийИспользуемыйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/DataProcessors/EmailNotificationOfActiveUsers/Forms/Форма/Module.bsl
&НаКлиенте
Процедура LoadUsers(Команда)
	
	LoadUsersНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура LoadUsersНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОПользователях.Пользователь КАК User,
	               |	СведенияОПользователях.ПоследнийИспользуемыйКлиент КАК Client1C,
	               |	СведенияОПользователях.ДатаПоследнейАктивности КАК LastActivityDate,
	               |	СведенияОПользователях.Пользователь.EMail КАК EMail,
	               |	СведенияОПользователях.Пользователь.ProcessLevel КАК ProcessLevel,
	               |	СведенияОПользователях.Пользователь.Код КАК Alias
	               |ИЗ
	               |	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
	               |ГДЕ
	               |	ИСТИНА";
	
	Если ЗначениеЗаполнено(PeriodOfActivity) Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|	И СведенияОПользователях.ДатаПоследнейАктивности >= &МинДатаПоследнейАктивности
		|	И СведенияОПользователях.ДатаПоследнейАктивности <= &МаксДатаПоследнейАктивности";
		
		Запрос.УстановитьПараметр("МинДатаПоследнейАктивности", PeriodOfActivity.ДатаНачала);
		Запрос.УстановитьПараметр("МаксДатаПоследнейАктивности", PeriodOfActivity.ДатаОкончания);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ProcessLevel) Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|	И СведенияОПользователях.Пользователь.ProcessLevel = &ProcessLevel";
		
		Запрос.УстановитьПараметр("ProcessLevel", ProcessLevel);
		
	КонецЕсли;

	ActiveUsers.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура GenerateEmailsList(Команда)
	
	Emails = ПолучитьТекстовыйДокументWithSelectedEmails();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстовыйДокументWithSelectedEmails()
	
	SelectedEmails = "";
	
	Для Каждого СтрокаТаб из ActiveUsers Цикл
		
		Разделитель = ?(ПустаяСтрока(SelectedEmails), "", "; ");
		
		SelectedEmails = SelectedEmails + Разделитель + 
						 ?(ПустаяСтрока(СтрокаТаб.EMail), "", СтрокаТаб.EMail);
		
	КонецЦикла;
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.ДобавитьСтроку(SelectedEmails);
	
    Возврат ТекстДок;
	
КонецФункции
